<?php

namespace Lessons\L_01_07;

/* 1.7 Операторы сравнения - равно, не равно, больше, меньше, больше или равно,
 * меньше или равно, идентично, не идентично */
function comparisonOperators()
{
    /* Операторы == и != сравнивают без учета типа.
     * Таким образом 0, False, '', '0', '0.0', 0.0 приводятся к одному значению. */
    $a = (0 == False) && (0 == '') && (0 == '0') && (0 == 0.0) && (0 == '0.0'); // True
    $b = (5 == True) && (5 == '5') && (5 == 5.0) && (5 == '5.0'); // True
    $с = (7 != 10); // True

    echo "a = {$a}; b = {$b}; с = {$с};\n";

    /* Операторы иднтичности === и !== сравнивают с учетом типа.
     * Таким образом 0, False, '', '0', '0.0', 0.0 все не идентичны друг другу. */
    $a = (0 === False) || (0 === '') || (0 === '0') || (0 === 0.0) || (0 === '0.0'); // False
    $b = (5 === True) || (5 === '5') || (5 === 5.0) || (5 === '5.0'); // False
    $с = (7 !== 10); // True

    echo "a = {$a}; b = {$b}; с = {$с};\n";

    $a = 2 > 1; // True
    $b = 1 < 2; // True
    $c = 1 >= 1; // True
    $d = 2 <= 2; // True
    $e = 2 <> 1; // True, аналогичен оператору !=

    echo "a = {$a}; b = {$b}; с = {$c}; d = {$d}; e = {$e};\n";
}