<?php

namespace Lessons\L_01_03;

/* 1.3 Существует три вида комментариев в php.
 * Все они представлены ниже. */
function comments()
{
    // Это однострочный комментарий, продолжающийся до конца строки

    # Это еще один однострочный комментарий, тоже продожающийся до конца строки

    /* Это многострочный комментарий
    который может распространяться на
    несколько строк */

    /* Или присутствовать */ /* сразу в нескольких местах */ /* на одной строке */

    // /* /* Нельзя вкладывать многострочные комментарии друг в друга, это приведет к ошибке */ */
}